DanielCao0/firmware/variants/nrf52840/rak_wismeshtag/variant.cpp
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
  Copyright (c) 2016 Sandeep Mistry All right reserved.
  Copyright (c) 2018, Adafruit Industries (adafruit.com)

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "variant.h"
#include "nrf.h"
#include "wiring_constants.h"
#include "wiring_digital.h"

#define OLED_DC (40)
#define OLED_CS (33)
#define OLED_RES (27)
#define OLED_POWER (7)


const uint32_t g_ADigitalPinMap[] = {
    // P0
    0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,

    // P1
    32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47};

void initVariant()
{
    // LED1 & LED2
    pinMode(PIN_LED1, OUTPUT);
    ledOff(PIN_LED1);

    pinMode(PIN_LED2, OUTPUT);
    ledOff(PIN_LED2);

    // 3V3 Power Rail
    pinMode(PIN_3V3_EN, OUTPUT);
    digitalWrite(PIN_3V3_EN, HIGH);

    pinMode(OLED_DC, OUTPUT);
    digitalWrite(OLED_DC, LOW);

    pinMode(OLED_CS, OUTPUT);
    digitalWrite(OLED_CS, LOW);

    pinMode(OLED_RES, OUTPUT);
    digitalWrite(OLED_RES, HIGH);

    pinMode(OLED_POWER, OUTPUT);
    digitalWrite(OLED_POWER, LOW);
    // delay(10);
    // digitalWrite(OLED_RES, LOW);
    // delay(10);
    // digitalWrite(OLED_RES, HIGH);

    //Wire1.setPins(PIN_WIRE1_SDA, PIN_WIRE1_SCL);
}
